{
  "aux_loss_alpha": 0.01,
  "bos_token_id": 1,
  "dropout": 0.0,
  "eos_token_id": 2,
  "flash_attn": true,
  "hidden_act": "silu",
  "hidden_size": 768,
  "inference_rope_scaling": false,
  "intermediate_size": 2048,
  "max_position_embeddings": 32768,
  "model_type": "minimind",
  "mrope_section": [
    12,
    10,
    10
  ],
  "n_routed_experts": 4,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 12,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 8,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "scoring_func": "softmax",
  "seq_aux": true,
  "transformers_version": "4.57.1",
  "use_moe": false,
  "vocab_size": 6403
}
